import React from 'react';
import SlideShow from './slideshow/SlideShow';
import CImg from '@/components/Image/CImg';

export default function page() {
    return (
        <div>
            {/* Banner */}
            {/* <Banner /> */}
            <div className="flex container mx-auto space-x-5 pt-10">
                <div>
                    <SlideShow />
                    <div className="space-y-4">
                        <h2 className="font-semibold text-4xl pt-4">দারুননাজাত সিদ্দীকিয়া কামিল মাদরাসায় আপনাকে স্বাগতম</h2>
                        <p className="justify-evenly text-lg tracking-wide  font-medium leading-9">
                            ঢাকা দক্ষিণ সিটি কর্পোরেশনের ৬৭ নং ওয়ার্ডের শুকুরসি গোরস্থান সংলগ্ন ডেমরা-নারায়ণগঞ্জ রোডের পশ্চিম পাশে, ডি.এন্ড.ডি. প্রজেক্টের মধ্যে ছায়া ঢাকা পাখি ডাকা মনোরম পরিবেশে অবস্থিত দেশের অন্যতম শ্রেষ্ঠ ইসলামী শিক্ষা প্রতিষ্ঠান ঐতিহ্যবাহী দারুননাজাত সিদ্দীকিয়া কামিল মাদরাসা। স্থানীয় কয়েক গ্রামবাসীর যৌথ উদ্যোগে ভারত বিভাগের এক বছর পূর্বে ১৯৪৬ ঈসায়ী সালে প্রতিষ্ঠিত হয়েছিল শুকুরসি গোরস্থান।

                            ১৯৪৬ থেকে ৮৬; দীর্ঘ ৪০ বছর পর মহান রাব্বুল আলামীনের অশেষ রহমতে কবরবাসীর জন্যে দুআ মাহফিল করার উদ্দেশ্যে এ কবরস্থানটির পাশে তৎকালীন একটি ধানক্ষেতে শুভাগমন ঘটে ছারছীনা শরীফের পীরে কামেল শাহ সূফী আবু জাফর মুহাম্মাদ সালেহ র. এর। মাহফিলের পর কবরবাসীদের জন্যে দুআর ধারা অব্যাহত রাখার মহান লক্ষ্যে গোরস্থানের পাশে একটি মাদরাসা প্রতিষ্ঠার আকাঙ্ক্ষা ব্যক্ত করলেন তিনি। এর জন্যে দুআও করলেন মহান আল্লাহর আলীশান দরবারে।

                            প্রায় জনমানব শূন্য এ এলাকাটিতে তখন বিরাজ করছিল এক ভীতিকর পরিবেশ। বৃষ্টির দিনে পানিতে প্রায় ডুবে যেত সবকিছু। চারদিকে ছিল বিশাল-বিস্তীর্ণ ধানক্ষেত। দিনের বেলায়ই চোখে পড়তো নানা ধরনের হিংস্র প্রাণী। সন্ধ্যায় ভেসে আসতো দলবদ্ধ শৃগালের হুক্কাহুয়া ডাক। চোর-ডাকাত আর দুর্বৃত্তদের অনেকটা অভয়াশ্রম ছিল এ এলাকা। রাতে তো দূরের কথা, মানুষজন সন্ধ্যা বেলায়ও এ এলাকায় চলাচল করতে ভয় পেতো। মেইন রোডের গলাকাটা পুল (বর্তমানে মাদরাসা ব্রিজ) এখনো সে বীভৎস পরিবেশের নীরব সাক্ষী।

                            ১৯৮৮ সনে পার্শ্ববর্তী করিম জুট মিলস লিমিটেড জামে মাসজিদের পেশ ইমাম আলহাজ্জ মাওলানা রুহুল আমীন সাহেবের সাথে এ এলাকার ১৮ জন পূণ্যবান ব্যক্তি পবিত্র হজ্জব্রত পালনের উদ্দেশ্যে গমন করেন পবিত্র মক্কাতুল মুকাররমায়। হজ্জ শেষে বাইতুল্লাহর চত্বরে বসে তারা সম্মিলিতভাবে পরামর্শ করে সিদ্ধান্ত নেন, দেশে ফিরে একটি মাদরাসা স্থাপন করবেন। পরবর্তীতে স্থানীয় সান্দিরা বালুঘাটে কবরস্থান সংশ্লিষ্ট এলাকার বিশিষ্ট ব্যক্তিদের নিয়ে সিদ্ধান্ত হয় শুকুরসী গোরস্থানের পাশে ‘দারুল ফেরদাউস’ নামে একটি ইবতেদায়ী মাদরাসা প্রতিষ্ঠার। সিদ্ধান্ত অনুসারে ১৯৮৯ সনে সেপ্টেম্বর মাসের কোন এক তারিখে এখানে একটি মাহফিলে ফুরফুরা শরীফের পীর আলহাজ্জ হযরত মাওলানা আব্দুল কাহহার সিদ্দীকী আল কুরাইশী র. এর মুবারক হাতে মরহুম হাজী আনসার আলী সাহেবের দান করা জমিতে অর্থাৎ, বর্তমান মাদরাসা মাঠের ঠিক মাঝামাঝি জায়গায় জলাবদ্ধ ধানক্ষেতের পানির মধ্যে একটি খুঁটি পুতে ভিত্তি স্থাপন করা হয় এ মাদরাসার। ফুরফুরার হুজুর র. ‘দারুল ফেরদাউস’ নামের পরিবর্তে  এর নাম রাখেন ‘দারুননাজাত’। হুজুর বলেন, “আগেতো নাজাত অর্জন করেন, পরে জান্নাতে যান।”

                            ১৯৯০ সনের জানুয়ারি মাসে পার্শ্ববর্তী হুসাইনিয়া জামে মাসজিদে পরিচালিত মক্তবটি এখানে এনে মাসজিদের ইমাম আলহাজ্জ মৌলভী নূরুল হক সাহেব কর্তৃক প্রথম শুরু হয় মাদরাসার একাডেমিক কার্যক্রম। ১৯৯০-১৯৯১ দুই বছর চলে ইবতেদায়ী স্তর। এর মধ্যে তিনজন ইবতেদায়ী প্রধান পরিবর্তন হন।

                            আল্লাহ তাআলার এক ইশারায় এবং তাঁর অশেষ মেহেরবানীতে ১৯৯১ সনের ১৬ ডিসেম্বর তারিখে ইবতেদায়ী প্রধান হিসেবে ৭০০ টাকা বেতনে দারুননাজাতের খেদমতে শরীক হন দারুননাজাতের বর্তমান সুযোগ্য অধ্যক্ষ মহোদয় আলহাজ্জ মাও. আ.খ.ম. আবুবকরসিদ্দীক মা.জি.আ.। আল্লাহর রহমতের ওপর ভরসা করে তিনি ১৯৯২ সনে দশম শ্রেণিতে একজন, নবম শ্রেণিতে একজন, অষ্টম শ্রেণিতে তিনজন, সপ্তম শ্রেণিতে ছয়জন ছাত্র নিয়ে শুরু করেন এর দাখিল স্তরের কার্যক্রম। আল্লাহর অশেষ রহমত, সর্বসাধারণের আস্থা ও সহযোগিতায় মাদরাসাটি ১৯৯৪ সনে আলিম, ১৯৯৬ সনে ফাযিল এবং ২০০৪ সনে কামিল পর্যায়ে উন্নীত হয়। লাভ হয় মাদরাসা বোর্ডের একাডেমিক অনুমতি ও মঞ্জুরী এবং ফাযিল পর্যায়ের শিক্ষক-কর্মচারিদের বেতন-ভাতাদির সরকারি অংশ। ২০১০ সালে এখানে আল কুরআন এন্ড ইসলামিক স্টাডিজ এবং আল হাদিস এন্ড ইসলামিক স্টাডিজ- এ দুটো বিষয়ে অনার্স কোর্স চালু করা হয়। ২০০৪ সালে কামিল (স্নাতকোত্তর) হাদিস, ২০১৬ সালে ফিকহ এবং সর্বশেষ ২০১৮ সালে তাফসির বিভাগ চালু করা হয়। আর কামিল (স্নাতকোত্তর) মাস্টার্স চালু হয় ২০১৭ সালে। এ যেন অবিশ্বাস্য স্বপ্নের এক সফল বাস্তবায়ন।




                        </p>
                    </div>
                </div>
                <div className="space-y-4">
                    {/* অধ্যক্ষ */}
                    <div className="">
                        <div className="w-64 h-80">
                            <CImg src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSDsrpbAteMpBL1EUCFaJiUs2UJkTwzaCWyylOMLvGTRw&s" />
                        </div>
                        <div className="font-semibold space-y-2 text-xl">
                            <h3 className="pt-2">অধ্যক্ষ</h3>
                            <h3>আবুল খায়ের মুহাম্মদ আবু বকর সিদ্দীক</h3>
                            <p className="font-normal">বি.এ. (অনার্স), এম.এ. (ঢাকা বিশ্ববিদ্যালয়); এম.এম. (১ম শ্রেণি)</p>
                        </div>
                    </div>
                    {/* নোটিশ বোর্ড */}
                    <div>
                        <div className="bg-base7 w-full relative ">
                            <h3 className="bg-base8 h-8 -top-1 text-base3 px-2 flex items-center font-semibold absolute">নোটিশ বোর্ড</h3>
                            <div className="bg-base7 w-full h-6" />
                        </div>
                        <div className="min-h-80">
                            <p>ody</p>
                        </div>
                        <div className="bg-base7 font-semibold text-base3 text-center">সমস্ত নোটিশ দেখুন </div>
                    </div>
                    {/* ফরম ডাউনলোড*/}
                    <div>
                        <div className="bg-base7 w-full relative ">
                            <h3 className="bg-base8 h-8 -top-1 text-base3 px-2 flex items-center font-semibold absolute">ফরম ডাউনলোড</h3>
                            <div className="bg-base6 w-full h-6" />
                        </div>
                        <div className="min-h-80">
                            <p>ody</p>
                        </div>
                        <div className="bg-base7 font-semibold text-base3 text-center">সমস্ত ফরম দেখুন </div>
                    </div>
                </div>
            </div>
            {/* <Home /> */}
        </div>
    )
}
